УчетВУправляющихДляГит1/src/Reports/РегламентированныйОтчетПрибыльСколковоРасчетПрибыли/РегламентированныйОтчетПрибыльСколковоРасчетПрибыли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>РегламентированныйОтчетПрибыльСколковоРасчетПрибыли</name>
</mdclass:Report>

УчетВУправляющихДляГит1/src/Enums/ВерсииФорматовВыгрузки/ВерсииФорматовВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВерсииФорматовВыгрузки</name>
  <enumValues>
    <name>Версия200</name>
  </enumValues>
  <enumValues>
    <name>Версия201</name>
  </enumValues>
  <enumValues>
    <name>Версия201алко</name>
  </enumValues>
  <enumValues>
    <name>Версия300</name>
  </enumValues>
  <enumValues>
    <name>Версия300алко</name>
  </enumValues>
  <enumValues>
    <name>Версия301алко</name>
  </enumValues>
  <enumValues>
    <name>Версия302алко</name>
  </enumValues>
  <enumValues>
    <name>Версия400</name>
  </enumValues>
  <enumValues>
    <name>Версия401алко</name>
  </enumValues>
  <enumValues>
    <name>Версия500</name>
  </enumValues>
  <enumValues>
    <name>Версия700ПФР</name>
  </enumValues>
  <enumValues>
    <name>ВерсияФСГС</name>
    <comment>Для статотчетности</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияФСС</name>
  </enumValues>
  <enumValues>
    <name>ВерсияРПН</name>
    <comment>Для отчетов в Росприроднадзор</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияБанкРоссии</name>
    <comment>Для отчетов в Банк России</comment>
  </enumValues>
  <enumValues>
    <name>ВерсияПФР</name>
  </enumValues>
  <enumValues>
    <name>ВерсияМинобороны</name>
    <comment>Для отчетов в Министерство Обороны</comment>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Reports/РегламентированныйОтчетПрибыльСколковоРасчетПрибыли/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВерсияФорматаВыгрузки(Знач НаДату = Неопределено, ВыбраннаяФорма = Неопределено) Экспорт
	
	Если НаДату = Неопределено Тогда
		НаДату = ТекущаяДатаСеанса();
	КонецЕсли;
		
	Если НаДату < '20070101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.Версия300;
	ИначеЕсли НаДату < '20090101' Тогда
		Возврат Перечисления.ВерсииФорматовВыгрузки.Версия400;
	Иначе
		Возврат Перечисления.ВерсииФорматовВыгрузки.Версия500;
	КонецЕсли;
		
КонецФункции

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",      ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв3";
	НоваяФорма.ОписаниеОтчета     = "Приложение №2 к приказу Минфина РФ от 30.12.2010 г. № 196н (в ред. Приказа Минфина РФ от 18.07.2011 № 83н).";
	НоваяФорма.РедакцияФормы	  = "от 18.07.2011 № 83н.";
	НоваяФорма.ДатаНачалоДействия = '20110914';
	НоваяФорма.ДатаКонецДействия  = РегламентированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ДеревоФормИФорматов() Экспорт
	
	ФормыИФорматы = Новый ДеревоЗначений;
	ФормыИФорматы.Колонки.Добавить("Код");
	ФормыИФорматы.Колонки.Добавить("ДатаПриказа");
	ФормыИФорматы.Колонки.Добавить("НомерПриказа");
	ФормыИФорматы.Колонки.Добавить("ДатаНачалаДействия");
	ФормыИФорматы.Колонки.Добавить("ДатаОкончанияДействия");
	ФормыИФорматы.Колонки.Добавить("ИмяОбъекта");
	ФормыИФорматы.Колонки.Добавить("Описание");
	
	Форма20111001 = ОпределитьФормуВДеревеФормИФорматов(ФормыИФорматы, "1150021", '20110718', "83н", "ФормаОтчета2011Кв3");
	ОпределитьФорматВДеревеФормИФорматов(Форма20111001, "5.01");
	
	Возврат ФормыИФорматы;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОпределитьФормуВДеревеФормИФорматов(ДеревоФормИФорматов, Код, ДатаПриказа = '00010101', НомерПриказа = "", ИмяОбъекта = "",
			ДатаНачалаДействия = '00010101', ДатаОкончанияДействия = '00010101', Описание = "")
	
	НовСтр = ДеревоФормИФорматов.Строки.Добавить();
	НовСтр.Код = СокрЛП(Код);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ДатаНачалаДействия;
	НовСтр.ДатаОкончанияДействия = ДатаОкончанияДействия;
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

Функция ОпределитьФорматВДеревеФормИФорматов(Форма, Версия, ДатаПриказа = '00010101', НомерПриказа = "",
			ДатаНачалаДействия = Неопределено, ДатаОкончанияДействия = Неопределено, ИмяОбъекта = "", Описание = "")
	
	НовСтр = Форма.Строки.Добавить();
	НовСтр.Код = СокрЛП(Версия);
	НовСтр.ДатаПриказа = ДатаПриказа;
	НовСтр.НомерПриказа = СокрЛП(НомерПриказа);
	НовСтр.ДатаНачалаДействия = ?(ДатаНачалаДействия = Неопределено, Форма.ДатаНачалаДействия, ДатаНачалаДействия);
	НовСтр.ДатаОкончанияДействия = ?(ДатаОкончанияДействия = Неопределено, Форма.ДатаОкончанияДействия, ДатаОкончанияДействия);
	НовСтр.ИмяОбъекта = СокрЛП(ИмяОбъекта);
	НовСтр.Описание = СокрЛП(Описание);
	Возврат НовСтр;
	
КонецФункции

#КонецОбласти

#КонецЕсли
